export default function OurVision() {
  return (
    <div className='min-height min-h-screen flex items-center justify-center bg-gradient-to-r from-blue-50 to-blue-100'>
      <div className='max-w-3xl mx-auto p-6 md:p-10 rounded-lg shadow-lg bg-white'>
        <h1 className='text-4xl font-bold text-blue-900 text-center mb-8'>
          رؤيتنا
        </h1>
        <div className='text-lg text-gray-700 leading-relaxed space-y-6'>
          <p>
            في رحلة الاعلام عبر الزمان، نتطلع إلى عالم يكون فيه الإعلام أداة قوية للتعليم، والتمكين، والتغيير الاجتماعي. نحن نؤمن بأنه من خلال فهم تطور الإعلام، يمكننا تقدير دوره في تشكيل الرأي العام، والثقافة، والمجتمع.
          </p>
          <p>
            هدفنا هو إنشاء منصة لا تعرض فقط التطور التاريخي للإعلام، ولكن أيضًا تشجع على التفكير النقدي والمناقشات حول تأثيره في العصر الرقمي. نسعى لإلهام جمهورنا للتفاعل مع الإعلام بطريقة أكثر وعياً ومسؤولية، معترفاً بالمسؤولية التي تأتي مع استهلاك وتوزيع المعلومات.
          </p>
          <p>
            من خلال تجارب مبتكرة وتفاعلية، نطمح إلى سد الفجوة بين الماضي والحاضر، مما يسمح للمستخدمين بالاتصال بالتاريخ الغني للإعلام مع التفكير في مستقبله. معًا، نأمل في تعزيز مجتمع يقدر الحوار المستنير، والإبداع، والإمكانات الإيجابية للإعلام في حياتنا.
          </p>
        </div>
      </div>
    </div>
  );
}
