export default function PrivacyAndPolicy() {
  return (
    <div className='min-h-screen flex items-center justify-center'>
      <div className='max-w-2xl mx-auto p-3 text-center'>
        <div>
          <h1 className='text-3xl font font-semibold text-center my-7'>
          سياسة الخصوصية
          </h1>
          <div className='text-md text-gray-500 flex flex-col gap-6'>
            <p>
تلتزم رحلة الاعلام عبر الزمان بحماية خصوصية مستخدمينا. تهدف سياسة الخصوصية هذه إلى توضيح كيفية جمع المعلومات، استخدامها، وحمايتها عند زيارتك لموقعنا.

1. المعلومات التي نجمعها
المعلومات الشخصية: قد نجمع معلومات شخصية مثل الاسم، البريد الإلكتروني، ومعلومات الاتصال عند التسجيل أو التواصل معنا.
المعلومات غير الشخصية: نجمع معلومات غير شخصية تلقائيًا، مثل نوع المتصفح، نظام التشغيل، وعنوان IP، وذلك لتحسين تجربتك على الموقع.
2. كيف نستخدم المعلومات
لتقديم الخدمات: نستخدم المعلومات لتوفير خدماتنا، تحسين المحتوى، واستجابة لطلبات المستخدمين.
للتواصل: قد نتواصل معك عبر البريد الإلكتروني لتزويدك بتحديثات، أخبار، أو معلومات حول المشروع.
لتحسين تجربة المستخدم: نستخدم المعلومات لتحليل سلوك المستخدمين وتحسين أداء الموقع.
3. حماية المعلومات
نحن نستخدم إجراءات أمان معقولة لحماية المعلومات الشخصية التي نجمعها. ومع ذلك، لا يمكن ضمان الأمان المطلق على الإنترنت.

4. مشاركة المعلومات
لن نشارك معلوماتك الشخصية مع أي طرف ثالث دون موافقتك، إلا إذا كان ذلك مطلوبًا بموجب القانون.

5. حقوق المستخدمين
لديك الحق في:

الوصول إلى المعلومات الشخصية الخاصة بك.
طلب تصحيح أو حذف معلوماتك.
إلغاء الاشتراك في التواصل التسويقي في أي وقت.
6. التغييرات على سياسة الخصوصية
قد نقوم بتحديث سياسة الخصوصية هذه من وقت لآخر. سنقوم بإعلامك بأي تغييرات عن طريق نشر السياسة الجديدة على هذه الصفحة.

7. الاتصال بنا
إذا كان لديك أي استفسارات أو مخاوف حول سياسة الخصوصية هذه، يمكنك الاتصال بنا عبر:

البريد الإلكتروني: test@gmail.com
الهاتف: 01273972861
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
