export default function TermsAndConditions() {
  return (
    <div className='min-h-screen flex items-center justify-center'>
      <div className='max-w-2xl mx-auto p-3 text-center'>
        <div>
          <h1 className='text-3xl font font-semibold text-center my-7'>
          الشروط والأحكام
          </h1>
          <div className='text-md text-gray-500 flex flex-col gap-6'>
            <p>
            مرحبًا بكم في [اسم مشروعك]! من خلال الوصول إلى موقعنا واستخدامه، توافق على الالتزام بهذه الشروط والأحكام. إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام الموقع.

1. الاستخدام
يُسمح لك باستخدام الموقع لأغراض شخصية وغير تجارية فقط.
يجب عليك عدم استخدام الموقع لأي غرض غير قانوني أو محظور.
2. المحتوى
جميع المحتويات المتاحة على الموقع، بما في ذلك النصوص، الصور، والفيديوهات، هي ملك لـ رحلة الاعلام عبر الزمان أو مرخصة لنا. يُمنع نسخ، توزيع، أو تعديل المحتوى بدون إذن كتابي مسبق.
3. المسؤولية
رحلة الاعلام عبر الزمان غير مسؤولة عن أي أضرار أو خسائر ناجمة عن استخدام الموقع أو عدم القدرة على الوصول إليه.
المحتوى والمعلومات المقدمة على الموقع هي لأغراض المعلومات فقط، ولا تعتبر نصيحة مهنية أو قانونية.
4. الروابط الخارجية
قد يحتوي الموقع على روابط لمواقع أخرى. نحن غير مسؤولين عن محتوى أو سياسات الخصوصية لتلك المواقع.
5. تغييرات الشروط
يحق لنا تعديل هذه الشروط والأحكام في أي وقت. سيتم نشر الشروط المعدلة على هذه الصفحة، ويعتبر استمرارك في استخدام الموقع بعد التعديلات موافقة على الشروط الجديدة.
6. القانون المعمول به
تخضع هذه الشروط والأحكام لقوانين جمهورية مصر العربية. أي نزاع ينشأ عن استخدام الموقع سيخضع للاختصاص القضائي للمحاكم في.
7. الاتصال بنا
إذا كان لديك أي استفسارات حول هذه الشروط والأحكام، يمكنك الاتصال بنا عبر:

البريد الإلكتروني: test@gmail.com
الهاتف: 01273972861
            </p>
          </div>
        </div>
      </div>
    </div>
  );
}
